---
type: GuidEnum
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# GuidEnum

`Autodesk.Revit.DB.GuidEnum` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | GuidEnum | — | `public GuidEnum ( Guid guid )` |
| Method | Equals | — | `public override bool Equals ( Object obj )` |
| Method | GetHashCode | — | `public override int GetHashCode ()` |
| Property | Guid | — | `public Guid Guid { get ; }` |